//-----------------------------------------------------------------------------
// File: config.h
// Auth: SnipGhost
//                                                 Вспомогательные функции ядра
//-----------------------------------------------------------------------------
#ifndef CONFIG_H 
#define CONFIG_H
//-----------------------------------------------------------------------------
#define _CRT_SECURE_NO_WARNINGS // За..колебали уже ворнинги тупых функций MS
//-----------------------------------------------------------------------------
#include <iostream>
#include <iomanip>
#include <fstream>
#include <string>
#include <vector>
#include <map>
//-----------------------------------------------------------------------------
using namespace std;
//-----------------------------------------------------------------------------
#define DEBUG_CRIT 1 // Вывод критических сообщений
#define DEBUG_WARN 1 // Вывод предупреждений
#define DEBUG_NORM 1 // Вывод сообщений об успехе
//-----------------------------------------------------------------------------
const int MAX_LINE = 255;       // Максимальная длина строки считываемого файла
//-----------------------------------------------------------------------------
extern map<string, int> typeCodes;  // Коды зарегестрированных типов
extern char *STD_DELIMS;            // Разделители по умолчанию
//-----------------------------------------------------------------------------
void showMsg(int type, string msg); // Отобразить отладочное сообщение
void readConfig(string path);       // Загрузить данные конфигурации
//-----------------------------------------------------------------------------
#endif /* CONFIG_H */
//-----------------------------------------------------------------------------